---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.GetValues
source: html/6f45b084-2c52-bfae-ae08-1945f716f55d.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.GetValues Method

Provides access to the value set stored with this demand factor definition

## Syntax (C#)
```csharp
public ICollection<ElectricalDemandFactorValue> GetValues()
```